#+TITLE: scratch 
#+DATE: <2016-04-26>
#+TODO: TODO PROGRESS | DONE

* 长期目标 
** full-stack engineer 
[[file:org.org::*project scratch]]

* 短期目标
* spiritual life 

* workout 
** TODO writing a workout plan 
[[file:workout.org]]

* health
- going upstairs 3 times a day in office
** TODO 8 cups of water per day
** go to bed early ( 12:00 )
remember the lesson you learn 
** DONE rest well, recover from cold 

* career
** TODO interview preparation


* thoughts 
- 最近浪费时间浪费的太多了。 基本上周末都在玩游戏中度过了
- leetcode上的题目没有及时复习，要忘记光了
- 书也没有看。
- 没有健身，好像自从结婚以后人就懒掉了。
  - 设定一个健身计划
  - file:workout.org
- 写代码低级bug太多了。 
  - 看别人编写代码视频
- git hub all projects
- utilize stand desk 
- spent too long on gaming 

<2016-06-16 Thu>
- gaming too much
- sleep too late. really bad habit 
- m routine is good. not too many, keep it ! the rule is don't do it at night

<2016-06-29 Wed>
- should spent more time on online code practice 
- should write cleaner code. 
- utilize what you learn in daily programming 





** DONE [#A] set the goal for WORK every day. 
- drqs
- projects 
- next things to do
- work until 5:00 - 5:30 pm

** DONE spent 1 ~ 2 hours non work related projects.			:gtd:
- i.e. reading, self studying 



* emacs learning						 :move:emacs:
** PROGRESS learn lisp language
   SCHEDULED: <2016-09-16 Fri ++5d>
   - State "DONE"       from "PROGRESS"   [2016-09-12 Mon 17:57]
   - State "DONE"       from "PROGRESS"   [2016-09-08 Thu 16:06]
   :PROPERTIES:
   :LAST_REPEAT: [2016-09-12 Mon 17:57]
   :END:
https://www.gnu.org/software/emacs/manual/html_mono/eintr.html
[[http://ergoemacs.org/emacs/elisp_basics.html]]
*** DONE emacs sync online ? 
    CLOSED: [2016-05-02 Mon 22:03]
auto sync 

** org mode 
*** DONE get familar with org mode [6/6]
    - Note taken on [2016-05-02 Mon 15:50] \\
      including regular org mode operations
    CLOCK: [2016-05-02 Mon 15:38]--[2016-05-02 Mon 16:43] =>  1:05
    CLOCK: [2016-05-02 Mon 15:35]--[2016-05-02 Mon 15:36] =>  0:01
http://www.fuzihao.org/blog/2015/02/19/org-mode%E6%95%99%E7%A8%8B/
- [X] adding timestamps to closed todo 
- [X] adding links 
- [X] adding bookmarks 
- [X] todo management  
- [X] agenda view
- [X] org mode log a task 

*** DONE org mode links 
    CLOSED: [2016-04-25 Mon 23:30]
    
*** DONE table mode for emacs 
    CLOSED: [2016-04-28 Thu 18:04]
*** DONE create diary
    CLOSED: [2016-05-03 Tue 11:48]
- [X] create a journal
- [ ] create a diary template

*** DONE capture template 
    CLOSED: [2016-05-03 Tue 11:48]
*** PROGRESS planning & recording tasks 


** DONE emacs code templating 
   CLOSED: [2016-05-21 Sat 23:18]
- choose a plugin
- adding simple templates

** magit tutorial 
*** DONE getting started 
    CLOSED: [2016-04-25 Mon 19:18]

*** DONE setting git on virtual machine 
    CLOSED: [2016-04-26 Tue 13:58]


** emacs lint 
*** DONE flycheck setting 

*** TODO set environment in work environment 
    
** emacs UML
*** TODO introduce UML to emacs 
- [X] image solution
- [ ] 


** emacs coding snippets
*** TODO create template for common language

** emacs shortcut 
*** DONE install emacs shortcut 
*** TODO install emacs window management 
    
** emacs helm mode 
*** DONE regular helm mode 
    CLOSED: [2016-04-28 Thu 17:31]


** emacs mode cheetsheet
| <11> mode name | <20> link            |
|----------------+----------------------|
| helm           |                      |
| org mode       |                      |
| magit          |                      |




** DONE emacs code re-factoring 

* self-improvement 
** TODO code refactoring tutorial				   :worktime:
   SCHEDULED: <2016-08-19 Fri ++1w>
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-22 Fri 16:45]
   - State "DONE"       from "TODO"       [2016-07-01 Fri 16:19]
   - State "DONE"       from "TODO"       [2016-06-16 Thu 18:08]
   - State "DONE"       from "TODO"       [2016-06-09 Thu 18:53]
   - State "DONE"       from "TODO"       [2016-05-17 Tue 03:50]
   :PROPERTIES:
   :LAST_REPEAT: [2016-07-22 Fri 16:45]
   :END:
file:refactor.org





* Productivity
** DONE clean email 
ios mail app is updated support bulk archive

** DONE publish script to publish article
** TODO find a way to learn more in work 

** DONE GTD
   DEADLINE: <2016-07-24 Sun>

** TODO [#B] mouse-less work flow

** TODO daily work work-flow

* pet project thoughts
** TODO a text processor 
the text processor process the text to find new vocabulary 

** idea, automate everything. 
- what can be automated during work? 
- what can be done during daily work 
- what can be done to help boosting productivity
- what can be done to help better investment 

** stock tracker.



** a email processor 
Analyze your email.






* learn new things 
** TODO try out unit-test. 
   CLOCK: [2016-08-22 Mon 18:00]--[2016-08-22 Mon 18:23] =>  0:23
- test driven development 
- unit test for nodejs project

** DONE subscribe programming blogs
   CLOSED: [2016-08-18 Thu 23:19]
- coding horror 

* entertainment
** DONE create a music playlist
   DEADLINE: <2016-07-10 Sun>
   - Note taken on [2016-07-11 Mon 16:16] \\
     postpone 









** DONE install gtx 1070 and play
   CLOSED: [2016-09-15 Thu 00:55]



** TODO game list
- writing down the games plan to play
* INBOX 
** TODO eBay sell items  
** TODO call python script in emacs?  
** TODO things you r interested in.  
** TODO record time 
** TODO breakfast plan 
